//====================================================================================================================================
//                                          BIBLIOTECAS
//====================================================================================================================================
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <Thermistor.h>
//====================================================================================================================================
//                               INFORMAÇÕES DA REDE
//======================================================================================================================================
const char* ssid = "************************************";// nome rede
const char* password = "****************"; // senha rede 

ESP8266WebServer server(80); // servidor na porta 80 
Thermistor temp(0); // Instância termistor terminal A0 entrada analógica do NodeMCU

//====================================================================================================================================
//                                    Função responsável por enviar os dados 
//====================================================================================================================================
void handleRoot() {
  float temperatura1 = temp.getTemp();
  
  
  String msg = "Temperatura:";
  String temperatura = String(temperatura1);
 
  server.send(200, "text/html",msg+"="+temperatura);  // 70.0e23.0
}
//====================================================================================================================================
//                                              Função erro
//======================================================================================================================================
void handleNotFound(){
  String message = "File Not Found\n";
  server.send(404, "text/plain", message);
}
//=========================================================================================================================================
//
//=====================================================================================================================================
void setup(void){
  
  Serial.begin(115200);
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  if (MDNS.begin("esp8266")) {
    Serial.println("MDNS responder started");
  }

  server.on("/", handleRoot);

  server.onNotFound(handleNotFound);

  server.begin();
  Serial.println("HTTP server started");
}

//====================================================================================================================================
//
//=====================================================================================================================================
void loop(void){
  server.handleClient();
  delay(1500);
}
//====================================================END==============================================================================
